[M_GoodBadmordechai MissionDefinition]
MissionName="The good, the bad, and Mordecai."
MissionDescription="Mordechai placed first several times in the Moxie's Underdome competition a few years ago. A thief named Carson stole a gift box and hid it somewhere. [place]dust[-place]. Mordecai asks you to find Carson and find out where he buried his weapons. You probably have a gun. "
TurnInDescription="You follow the footsteps of three treasure hunters in their successful search for the lost ark of Mordecai. very well!"
MissionSummary="Find Mordecai's lost treasure chest."
MissionGiver="Mordecai"
MissionTurnInLocation="It is dust"
TeaserText="Mordecai buried his old treasure, if you can, it's yours.."

[M_GoodBadMordecai:GoodBadMordecai_DigUpStash MissionObjectiveDefinition]
ProgressMessage="Dig a hole"

[M_GoodBadMordecai:GoodBadMordecai_FindCarson MissionObjectiveDefinition]
ProgressMessage="I'm looking for Carson."

[M_GoodBadMordecai:GoodBadMordecai_FindStash MissionObjectiveDefinition]
ProgressMessage="Find a place to hide"

[M_GoodBadMordecai:GoodBadMordecai_FreeCarson MissionObjectiveDefinition]
ProgressMessage="Get Carson out of jail."

[M_GoodBadMordecai:GoodBadMordecai_PickUpCarsonEcho MissionObjectiveDefinition]
ProgressMessage="Echo in."

[M_GoodBadMordecai:GoodBadMordecai_PickUpPrisonEcho MissionObjectiveDefinition]
ProgressMessage="Take the Carson Echo"

[M_GoodBadMordecai:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride="Mordecai was buried in a gun pit."
MissionDescriptionOverride=""

[M_GoodBadMordecai:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_GoodBadMordecai:MissionObjectiveSetDefinition_3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_GoodBadMordecai:MissionObjectiveSetDefinition_6 MissionObjectiveSetDefinition]
MissionSummaryOverride="Kill Gettle and Mobley."
MissionDescriptionOverride="Last year, Mordecai took first place at the Moxie Androme. Soon, a thief named Carson stole the gift box and hid it somewhere. [place]dirt[-place]. Mordecai finds Carson and tells him that if he knew where the gun was, he would have kept it. You see guns everywhere, but now you have to fight the Mobleys and a mobster named Captain Hyperion Gittle to get one.."

[M_GoodBadMordecai:ObjSet_OpenStash MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_GoodBadMordecai:ObjSet_OpenStashHidden MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_GoodBadMordecai:ObjSet_Prison MissionObjectiveSetDefinition]
MissionSummaryOverride="Look for Carson [place]Friendly Gulag Hyperion[-place]."
MissionDescriptionOverride="Last year, Mordecai took first place in Moxie's Underdome. Seconds later, a thief named Carson steals the gift box and hides it inside. [place]Lot[-place]. Mordecai says he can keep the gun if he finds Carson and takes him to where he belongs. After discovering Carson's dead brother's ultrasound machine, he learns that an engineer named Gettle has kidnapped Carson and is holding him captive. [place]Hyperion Gulag Fellowship[-place]."

[M_GoodBadMordecai:ObjSet_PrisonEcho MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_GoodBadMordecai:ObjSetStash MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="A few years ago, Mordecai Moxey won first prize in the Underdome competition. After some time, a thief named Carson steals the gift box and hides its location [place]Dirty people[-place]. Mordecai says they can hide the gun if they find Carson and find out where he buried it. The good news is that you got Carson; The bad news is that a man named Mobley shot him in his room. However, you will find something important: Mordecai was buried in an unknown tomb in the plain.."

[M_GoodBadMordecai:OpenStash MissionObjectiveDefinition]
ProgressMessage="Open a shop."

[M_GoodBadMordecai:Survive_Showdown MissionObjectiveDefinition]
ProgressMessage="Live in a three-way struggle"

